{"keras_version": "1.0.7", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "trainable": true, "batch_input_shape": [null, 64, 64, 3], "name": "lambda_1", "arguments": {}, "function_type": "lambda", "input_dtype": "float32", "output_shape_type": "raw", "function": "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0091\u0000\u0000\u0000s\u0000\u0000\u0000\u0000"}}, {"class_name": "ZeroPadding2D", "config": {"input_dtype": "float32", "trainable": true, "padding": [1, 1], "batch_input_shape": [null, 64, 64, 3], "name": "zeropadding2d_1"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 32, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "name": "convolution2d_1", "activation": "linear", "b_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_2"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 32, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "name": "convolution2d_2", "activation": "linear", "b_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "ZeroPadding2D", "config": {"input_dtype": "float32", "trainable": true, "padding": [1, 1], "batch_input_shape": [null, 64, 64, 3], "name": "zeropadding2d_3"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "name": "convolution2d_3", "activation": "linear", "b_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_4"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "name": "convolution2d_4", "activation": "linear", "b_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ZeroPadding2D", "config": {"input_dtype": "float32", "trainable": true, "padding": [1, 1], "batch_input_shape": [null, 64, 64, 3], "name": "zeropadding2d_5"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 128, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "name": "convolution2d_5", "activation": "linear", "b_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [1, 1], "name": "zeropadding2d_6"}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_row": 3, "nb_col": 3, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 128, "dim_ordering": "tf", "trainable": true, "activity_regularizer": null, "name": "convolution2d_6", "activation": "linear", "b_regularizer": null, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "batch_input_shape": [null, 3, 64, 64], "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "b_regularizer": null, "output_dim": 256, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_2", "activation": "linear", "b_regularizer": null, "output_dim": 64, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_3", "activation": "linear", "b_regularizer": null, "output_dim": 16, "bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_9"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Dense", "config": {"W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "name": "dense_4", "activation": "linear", "b_regularizer": null, "output_dim": 1, "bias": true}}]}